package com.example.multi_game.data

class Storys(
    val story: String,
    val choice: List<String>
)

val dialogs = listOf(
    Storys(
        "ณ ป่าใหญ่แห่งหนึ่ง มีกระต่ายตัวหนึ่งมั่นใจในความเร็วของฝีเท้าตัวเองมาก และมักพูดโม้โอ้อวดว่าไม่มีใครเทียบเทียมได้จนวันหนึ่ง เจ้ากระต่ายได้พบกับเต่าที่กำลังเดินต้วมเตี้ยมผ่านมา กรุณาเลือกบทบาทของคุณ",
        listOf("กระต่าย", "เต่า")
    ),
    Storys(
        "ตอนนี้บทบาทของคุณคือกระต่าย ภารกิจของคุณคือการวิ่งให้ชนะคู่แข่ง",
        listOf("พูดล้อเลียนเต่า", "ให้กำลังใจเต่า")
    ),
    Storys(
        "ตอนนี้บทบาทของคุณคือเต่า ภารกิจของคุณคือการวิ่งให้ชนะคู่แข่ง เมื่อกระต่ายเห็นคุณ กระต่ายก็หัวเราะเยาะและพูดล้อเลียนคุณ",
        listOf("ท้าแข่งวิ่งกับกระตาย","ด่าแล้วทาแข่งวิ่งกับกระต่าย")
    ),
    Storys(
        "กระต่ายเห็นว่าเต่าท้าแข่งอยางนั้นก็ตอบตกลงเมื่อถึงวันแข่ง ก่อนที่จะเริ่มแข่ง",
        listOf("ใส่ยานอนหลบในน้ำให้กระต่ายดื่ม", "ไม่ทำอะไร")
    ),
    Storys(
        "กระต่ายไม่เป็นอะไรเลย เนื่องจากปกติกระตายก็ง่วงตลอดเวลาอยู่แล้ว",
        listOf("...", "...")
    ),
    Storys(
        "เมื่อเริ่มการแข่งขัน กระตายก็วิ่งนำคุณไปแล้ว",
        listOf("หลับ", "ใชทางลัด")
    )
)
